app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]
---
  def index

    if params[:artist_id]
      @artist = find_instance(Artist, params[:artist_id])
      if @artist
        @songs = @artist.songs
      else
        flash[:alert] = 'Artist not found'
        redirect_to artists_path
      end

    else
      @songs = Song.all